/*
алгоритм
 --все будет в одном большом классе (кнопки, функции для работы с файлами и т.д.)
1. создать таблицу
2. организовать туда добавление/удаление + соответствующие кнопочки меню
    - в главном окне кнопки а-ля "добавить запись"
    - при нажатии на кнопку диалоговое окно а-ля "введите шонибудь"
3. организовать работу с файлами
4. пофиксить до алмост идеала
*/

import view.MainDisplay;

public class Main {
    public static void main (String ... args){
        MainDisplay mainDisplay = new MainDisplay();
    }
}
